InformationRegisters/КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГоловнойСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>22</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОрганизацияПоОкончании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПодразделениеПоОкончании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДолжностьПоШтатномуРасписаниюПоОкончании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДолжностьПоОкончании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидСобытияПоОкончании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидЗанятостиПоОкончании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидДоговораПоОкончании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КадроваяИсторияСотрудниковИнтервальный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КадроваяИсторияСотрудниковИнтервальный</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодПредыдущейЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГоловнойСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>22</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РегистраторЗаписи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыКадровойИстории</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистраторСобытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыКадровойИстории</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПустойИнтервал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/КадроваяИсторияСотрудников/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадрыПериодическиеРегистры.КонтрольИзмененийПередЗаписью(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадрыПериодическиеРегистры.КонтрольИзмененийПриЗаписи(ЭтотОбъект);
	
	ОбновитьИнтервальныйРегистрСведений();
	
	КадровыйУчет.КадроваяИсторияСотрудниковПриЗаписи(ЭтотОбъект, Отказ);
	
	ИзменившиесяДанные = ТаблицаИзменившихсяДанныхНабора();
	КадровыйУчет.ОбработатьИзменениеОрганизацийВНаборе(ИзменившиесяДанные);
	КабинетСотрудника.ОбработатьИзменениеКадровойИстории(ИзменившиесяДанные);
	УчетПособийСоциальногоСтрахования.ПриЗаписиРегистраКадроваяИсторияСотрудников(ЭтотОбъект, Отказ, Замещение, ИзменившиесяДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак сформированности таблицы изменений
//
Функция ТаблицаИзменившихсяДанныхНабораСформирована() Экспорт
	Возврат ЗарплатаКадрыПериодическиеРегистры.ТаблицаИзменившихсяДанныхНабораСформирована(ЭтотОбъект);
КонецФункции

// Возвращает таблицу изменений регистра
//
Функция ТаблицаИзменившихсяДанныхНабора() Экспорт
	Возврат ЗарплатаКадрыПериодическиеРегистры.ТаблицаИзменившихсяДанныхНабора(ЭтотОбъект);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьИнтервальныйРегистрСведений()
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ИзменившиесяДанныеНабора = ТаблицаИзменившихсяДанныхНабора();
	
	Если ИзменившиесяДанныеНабора <> Неопределено
		И ИзменившиесяДанныеНабора.Количество() > 0 Тогда
		
		СписокСотрудников = ИзменившиесяДанныеНабора.ВыгрузитьКолонку("Сотрудник");
			
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Сотрудники.Ссылка КАК Сотрудник
			|ПОМЕСТИТЬ ВТТаблицаОтбора
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	Сотрудники.Ссылка В(&СписокСотрудников)";
		Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
		Запрос.Выполнить();
		
		ЗарплатаКадрыПериодическиеРегистры.СоздатьВТРегистраторыДляОбновления(
			"КадроваяИсторияСотрудников", 
			МенеджерВременныхТаблиц, 
			"Сотрудник", 
			ЭтотОбъект);
		
	КонецЕсли;
	
	ЗарплатаКадрыПериодическиеРегистры.СформироватьДвиженияИнтервальногоРегистраПоИзменениям(
		Метаданные.РегистрыСведений.КадроваяИсторияСотрудников.Имя, ЭтотОбъект);
		
	Если ДополнительныеСвойства.Свойство("ОбновлятьУвольнение")
		И ДополнительныеСвойства.ОбновлятьУвольнение
		И ИзменившиесяДанныеНабора <> Неопределено
		И ИзменившиесяДанныеНабора.Количество() Тогда
		
		ОбновитьВторичныеДанныеУвольнения(МенеджерВременныхТаблиц);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьВторичныеДанныеУвольнения(МенеджерВременныхТаблиц)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РегистрСведений.Период КАК Период,
	|	РегистрСведений.Регистратор КАК Регистратор,
	|	РегистрСведенийИнтервальный.ДатаОкончания КАК ДатаОкончания,
	|	РегистрСведенийИнтервальный.ДатаНачала КАК ДатаНачала,
	|	РегистрСведенийИнтервальный.ПериодЗаписи КАК ПериодЗаписи,
	|	РегистрСведенийИнтервальный.Год КАК Год,
	|	РегистрСведенийИнтервальный.ПериодПредыдущейЗаписи КАК ПериодПредыдущейЗаписи,
	|	РегистрСведений.Регистратор КАК РегистраторЗаписи,
	|	РегистрСведений.Регистратор КАК РегистраторСобытия,
	|	#ТекстОписанияПолейРегистра,
	|	#ТекстОписанияПолейСреза  
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников КАК РегистрСведений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРегистраторыДляОбновления КАК ВТРегистраторыДляОбновления
	|		ПО ВТРегистраторыДляОбновления.Регистратор = РегистрСведений.Регистратор 
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК РегистрСведенийСрез
	|		ПО (ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РегистрСведений.Период, ДЕНЬ), СЕКУНДА, -1) >= РегистрСведенийСрез.ДатаНачала)
	|			И (ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(РегистрСведений.Период, ДЕНЬ), СЕКУНДА, -1) <= РегистрСведенийСрез.ДатаОкончания)
	|			И РегистрСведений.Сотрудник = РегистрСведенийСрез.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК РегистрСведенийИнтервальный
	|		ПО (РегистрСведений.Период = РегистрСведенийИнтервальный.ДатаНачала)
	|			И (РегистрСведений.Период <= РегистрСведенийИнтервальный.ДатаОкончания)
	|			И РегистрСведений.Сотрудник = РегистрСведенийИнтервальный.Сотрудник 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ОписаниеРегистра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеРегистра("КадроваяИсторияСотрудников");
	
	МассивСтрокОписанияПолейРегистра = Новый Массив;
	МассивСтрокОписанияПолейСреза = Новый Массив;
	Разделитель = "," + Символы.ПС;
	Для каждого Измерение Из ОписаниеРегистра.Измерения Цикл
	
		МассивСтрокОписанияПолейРегистра.Добавить("РегистрСведений.");
		МассивСтрокОписанияПолейРегистра.Добавить(Измерение);
		МассивСтрокОписанияПолейРегистра.Добавить(Разделитель);

	КонецЦикла; 	
	
	Для каждого Реквизит Из ОписаниеРегистра.Реквизиты Цикл
		
		МассивСтрокОписанияПолейРегистра.Добавить("РегистрСведений.");
		МассивСтрокОписанияПолейРегистра.Добавить(Реквизит);
		МассивСтрокОписанияПолейРегистра.Добавить(Разделитель);
	
	КонецЦикла; 
		
	Для каждого Ресурс Из ОписаниеРегистра.ВозвратныеРесурсы Цикл
	
		МассивСтрокОписанияПолейСреза.Добавить("РегистрСведенийСрез.");
		МассивСтрокОписанияПолейСреза.Добавить(Ресурс);
		МассивСтрокОписанияПолейСреза.Добавить(Разделитель);
		
	КонецЦикла; 
		
	Для каждого Ресурс Из ОписаниеРегистра.Ресурсы Цикл
	
		МассивСтрокОписанияПолейСреза.Добавить("РегистрСведенийСрез.");
		МассивСтрокОписанияПолейСреза.Добавить(Ресурс);
		МассивСтрокОписанияПолейСреза.Добавить(Разделитель); 
	
	КонецЦикла;
	
	Если МассивСтрокОписанияПолейРегистра.Количество() > 0 Тогда
		МассивСтрокОписанияПолейРегистра.Удалить(МассивСтрокОписанияПолейРегистра.Количество() - 1);
	КонецЕсли; 
	
	Если МассивСтрокОписанияПолейСреза.Количество() > 0 Тогда
		МассивСтрокОписанияПолейСреза.Удалить(МассивСтрокОписанияПолейСреза.Количество() - 1);
	КонецЕсли; 
	
	ТекстОписанияПолейРегистра = СтрСоединить(МассивСтрокОписанияПолейРегистра);
	ТекстОписанияПолейСреза = СтрСоединить(МассивСтрокОписанияПолейСреза);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстОписанияПолейРегистра", ТекстОписанияПолейРегистра);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТекстОписанияПолейСреза", 	ТекстОписанияПолейСреза);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьЗапросУничтоженияВременнойТаблицы(ТекстЗапроса, "ВТРегистраторыДляОбновления");
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НаборЗаписей = РегистрыСведений.КадроваяИсторияСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ЭтоВторичныйНабор", Истина);
	НаборЗаписейИнтервальный = РегистрыСведений.КадроваяИсторияСотрудниковИнтервальный.СоздатьНаборЗаписей();
	
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
		
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		Пока Выборка.Следующий() Цикл
		
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение;
			
			НаборЗаписейИнтервальный.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
			НаборЗаписейИнтервальный.Отбор.ДатаНачала.Установить(Выборка.Период);
			НоваяСтрокаИнтервальный = НаборЗаписейИнтервальный.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИнтервальный, Выборка);
			НоваяСтрокаИнтервальный.ВидСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение;
			НаборЗаписейИнтервальный.Записать();
			НаборЗаписейИнтервальный.Очистить();
			
		КонецЦикла; 
		НаборЗаписей.Записать();
		НаборЗаписей.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
